# <font color='#eb3483'> Warming up SQL and pandas </font>

To get everyone in the right mindset for today's class, we have a mini SQL and pandas challenge! I've already given you the code before to set-up a database connection to the nobel database. You take it from here :)

In [1]:
#Import our packages
import sqlite3
from sqlite3 import Error #We're going to use this for some fancy error handling
import pandas as pd

In [2]:
def db_connect(db_name):
    try:
        conn = sqlite3.connect(db_name)
        print("Connection established")
    except Error:
        print(Error, "Cannot create connection to database")
    return conn

In [3]:
conn = db_connect("data/nobel.db")

Connection established

### <font color='#eb3483'> Exercise 1 </font>
Recall that the laureates table in our database has demographic information about every nobel laureate. Write and execute a SQL query to find the total number of laureates for each gender.

In [9]:
pd.read_sql("SELECT gender, COUNT(*) AS num_laureates FROM laureates GROUP BY gender;", conn)

   gender  num_laureates
0  female             53
1    male            866
2     org             24

### <font color='#eb3483'> Exercise 2 </font>
What country has the most female laureates? For this question you can either write it all in SQL (you might need to use `ORDER BY` clause which sorts rows in a query), or write sql and then sort using pandas.

In [11]:
pd.read_sql("SELECT bornCountry, \
            COUNT(*) AS num_female FROM laureates WHERE gender = 'female' GROUP BY bornCountry \
            ORDER BY num_female DESC LIMIT 2;", conn)

  bornCountry  num_female
0         USA          12
1      France           3